# Learning Objectives:

1. Statistical methods offered by pandas:
2. Finding min/max in each column
3. Describing data using one function

In [1]:
import numpy as np
import pandas as pd

In [2]:
scores_data = {"Student": ["Tom", "Katey", "Mak", "Bill", "Tom", "Rahul"],
               "Age": np.random.randint(20, 25, size=6),
               "Sub1_Score": np.random.randint(40, 100, size=6),
               "Sub2_Score": np.random.randint(40, 100, size=6),
               "Sub3_Score": np.random.randint(40, 100, size=6)
              }

scores_df = pd.DataFrame(scores_data)
scores_df['Sub4_Score'] = [67, 56, 89, np.nan, 78, None]
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  Sub4_Score
0     Tom   24          82          53          67        67.0
1   Katey   24          45          47          54        56.0
2     Mak   24          85          99          83        89.0
3    Bill   20          41          78          56         NaN
4     Tom   20          67          87          82        78.0
5   Rahul   21          75          44          87         NaN

## Statistical methods

* `count()`
* `sum()`
* `mean()`
* `std()`
* `median()`

In [3]:
scores_df.count()

Student       6
Age           6
Sub1_Score    6
Sub2_Score    6
Sub3_Score    6
Sub4_Score    4
dtype: int64

In [4]:
scores_df.mean()

Age           22.166667
Sub1_Score    65.833333
Sub2_Score    68.000000
Sub3_Score    71.500000
Sub4_Score    72.500000
dtype: float64

In [5]:
scores_df.sum()

Student       TomKateyMakBillTomRahul
Age                               133
Sub1_Score                        395
Sub2_Score                        408
Sub3_Score                        429
Sub4_Score                      290.0
dtype: object

In [6]:
scores_df.std()

Age            2.041241
Sub1_Score    18.787407
Sub2_Score    23.082461
Sub3_Score    14.487926
Sub4_Score    14.200939
dtype: float64

In [7]:
scores_df.median()

Age           22.5
Sub1_Score    71.0
Sub2_Score    65.5
Sub3_Score    74.5
Sub4_Score    72.5
dtype: float64

In [9]:
scores_df.iloc[: , 2:].mean()

Sub1_Score    65.833333
Sub2_Score    68.000000
Sub3_Score    71.500000
Sub4_Score    72.500000
dtype: float64

## Finding min/max in each column

In [10]:
scores_df['Age'].idxmax()

0

In [11]:
scores_df['Age'].max()

24

In [12]:
scores_df['Age'].idxmin()

3

In [13]:
scores_df['Age'].min()

20

## Describe your data using one function

In [14]:
scores_df.describe()

             Age  Sub1_Score  Sub2_Score  Sub3_Score  Sub4_Score
count   6.000000    6.000000    6.000000    6.000000    4.000000
mean   22.166667   65.833333   68.000000   71.500000   72.500000
std     2.041241   18.787407   23.082461   14.487926   14.200939
min    20.000000   41.000000   44.000000   54.000000   56.000000
25%    20.250000   50.500000   48.500000   58.750000   64.250000
50%    22.500000   71.000000   65.500000   74.500000   72.500000
75%    24.000000   80.250000   84.750000   82.750000   80.750000
max    24.000000   85.000000   99.000000   87.000000   89.000000

In [15]:
scores_df.describe(include="object")

       Student
count        6
unique       5
top        Tom
freq         2